{"meta":{"title":"ASTAR-LAB","subtitle":"一切都很美好","description":"","author":"ASTAR-LAB","url":"https://ASTAR-LAB.github.io","root":"/"},"pages":[{"title":"Projects","date":"2020-08-30T14:40:51.000Z","updated":"2025-02-03T05:07:36.226Z","comments":true,"path":"Projects/index.html","permalink":"https://astar-lab.github.io/Projects/index.html","excerpt":"","text":"Morphing Aircraft Advances in the development of smart actuators and compliant structures have led to widespread interest in morphing wings. The aircraft system can therefore integrate morphing concepts to allow shape changes of the structure, and thus adapt its aero-dynamic properties to suit changing mission requirements. Morphing aircraft concepts are showing the potential to significantly reduce the mass and energy consumption, and improve flight per-formance, compared to traditional aircraft structures, and hence they are receiving widespread interest across the aerospace industry. Reconfigurable smart structure(design, dynamic and lab demonstration) The term ‘smart structures’ is commonly used to describe structures which have the ability to actively change their geometry or mechanical properties. Potential applications can be found in the aerospace, energy and marine sectors, e.g. use of MEMS-type devices which require frequent switching of compliant components and morphing of advanced aerofoils to generate additional lift. Our vision is to take advantage of modern dynamical system theory to develop entirely new devices that use the instability of mechanical systems to deliver energy-efficient shape-changing structures. Transitioning between actively controlled unstable states (so-called ‘heteroclinic connections’) can be significantly more energy-efficient than traditional structures which transition between stable states. Dynamics and Control More Information:SABRE: Shape Adaptive Blades for Rotorcraft Efficiency(Coordinated by UNIVERSITY OF BRISTOL)"},{"title":"Publications","date":"2020-08-30T03:41:17.000Z","updated":"2025-02-03T05:07:36.226Z","comments":true,"path":"Publications/index.html","permalink":"https://astar-lab.github.io/Publications/index.html","excerpt":"","text":"Peer Review Journal Papers Zhao, Y., Wang, C., He, Z.,Cai, J., Zhang, Y., Shen, X. and Zhang, J. 鱼骨式变体机翼的能量平衡驱动系统设计与验证(Design and verification of energy balance actuation system for fishbone morphing wings). 工程科学学报(Chinese Journal of Engineering),11(2025), 107786.PDF Zhu, X., Zhang, J., Chen, W., and Gu, H. Tension-twist coupling morphing wing using a novel mechanical metamaterial. Aerospace Science and Technology,155(2024), 109745.PDF Wang, C., Zhao, Y., Huang, K., Zhang, J., Shaw, A. D., Gu, H., Amoozgar, M.,Friswell, M.I. and Woods B.K.S. Integration of the passive energy balancing based actuation system into a camber morphing design. Aerospace Science and Technology,128(2024), 107786.PDF Li, Z., Zhao, Z., Zhang, J. and Liu, C.A novel experimental method for bolt stress distribution during the assembly process. Structures, 69(2024), 107413.PDF Wu, G., Tong, Y., Zhang, J. and Zhao, Z. Design and Dynamic Analysis of a Spanwise Morphing Wing for Mars Exploration. Aerospace Science and Technology,155(2024), 109586.PDF He, Z., Fan, S., Wang, C., Li, S., Zhao, Y., Shen, X. and Zhang, J. Conceptual Design of Compliant Structures for Morphing Wingtips Using Single-Row Corrugated Panels. Aerospace,11(2024), 107786.PDF Huang, K., Zhang, J. and Wang, C.鱼骨柔性翼等效结构建模及其气动弹性特性分析(Equivalent structure model of fish bone active camber morphing concept and analysis of aeroelastic characteristics). 南京航空航天大学学报(Journal of Nanjing University of Aeronautics &amp; Astronautics)，2024,56(3)：516‑525.PDF Zhu, X., Huang, K., Chen, W. and Zhang, J., 基于胞元堆叠的拉伸⁃扭转耦合变形结构设计与增材制造验证 (Designing and Additive Manufacturing of Coupled Tension⁃Twist Morphing Structure Based on Cell Stacking), 中国激光(Chinese Journal of Lasers), 2024, 51(10): 1002311.PDF Zhang, J., Huang, K., Wu, G., Wang, C. and Nie, R., 变体飞行器结构关键技术及研究进展 (Key Technologies and Research Progress of Morphing Aircraft structure), 电光与控制(Electronics Optics &amp; Control), 2023, 55(2): 487-496.PDF Wang, C., Mao, Y., Liu, Q., Fan, S., Shen, X., Zhang, J. and Xia, Y., Predicting and Reinforcing the Critical Buckling Loads of Flexible Corrugated Panels. Machines 2023, 11, 339.PDF Liu, Y., Zhang, J., Pan, D.，Wu, Z.，and Wang, Q., Resonant Actuation Based on Dynamic Characteristics of Bistable Laminates. Machines, 2023, 11, 318.PDF Huang, K., Zhang, J., and Wang, Q., 基于非均匀梁模型的二维柔性机翼固有振动分析 (Natural vibration analysis of two-dimensional flexible wing based on non-uniform beam model), 力学学报(Chinese Journal of Theoretical and Applied Mechanics), 2023, 55(2): 487-496.PDF Gu, H., Taghipour J., Shaw, A. D., Amoozgar, M., Zhang, J., Wang, C., and Friswell, M. I., Tailored twist morphing achieved using graded bend-twist metamaterials, Composite Structures, 300 (2022), 116151.PDF Zhang J., Shaw, A.D., Wang, C., Gu,H., Amoozgar, M.R. and Friswell, M.I., Resonant Passive Energy Balancing for a Morphing Helicopter Blade. Aerospace Science and Technology,128(2022), 107786.PDF Shaw, A.D., Zhang J., Wang, C., Woods B.K.S. and Friswell, M.I., System-Level Optimization of Passive Energy Balancing, AIAA Journal, 60(9), 5570-5580.PDF Gu, H., Taghipour J., Rivero A., Amoozgar, M., Shaw, A. D., Zhang J., Wang, C., and Friswell, M. I., Experimental validation of inertial twist concept for rotor blade application. Composite Structures, 288 (2022), 115414.PDF Taghipour, J., Zhang J.,Shaw, A. D.,Friswell, M. I., Gu, H. and Wang, C., Resonant Passive Energy Balancing of Morphing Helicopter Blades with Bend-Twist Coupling. Nonlinear Dynamics, 107, 617–639 (2022). PDF Gu, H., Amoozgar, M., Shaw, A. D., Zhang J., Wang, C., and Friswell, M. I., Experimental study of lag-twist coupling concept for rotor blade application. Composite Structures, 275 (2021) , 114417. PDF Zhang J., Shaw, A.D., Wang, C., Gu, H., Amoozgar, M.R., Friswell, M.I. and Woods B.K.S. Aeroelastic Model and Analysis of an Active Camber Morphing Wing. Aerospace Science and Technology, 111 (2021), 106534. PDF Zhang J., Wang, C., Shaw, A.D., Amoozgar, M.R. and Friswell, M.I., Passive energy balancing design for a linear actuated morphing wingtip structure. Aerospace Science and Technology, 107 (2020), 106279. PDF Gu, H., Shaw, A. D., Amoozgar, M., Zhang J., Wang, C., and Friswell, M. I., Twist morphing of a composite rotor blade using a novel metamaterial. Composite Structures, 254 (2020) , 112855. PDF Zhang J., Shaw, A.D., Amoozgar, M.R., Friswell, M.I. and Woods B.K.S. Bidirectional Spiral Pulley Negative Stiffness Mechanism for Passive Energy Balancing. ASME Journal of Mechanisms and Robotics, 11(5), p. 054502. PDF Amoozgar, M.R., Shaw, A.D., Zhang J., Wang, C and Friswell, M.I., Lag-twist coupling sensitivity and design for a composite blade cross-section with D-spar. Aerospace Science and Technology, 91(2019),pp. 539-547. PDF Amoozgar, M.R., Shaw, A.D., Zhang J. and Friswell, M.I., The effect of a movable mass on the aeroelastic stability of composite hingeless rotor blades in hover. Journal of Fluids and Structures. 87(2019), pp. 124–136. PDF Zhang J., Wu Z., Zhang, C., Hao, L., Nie, R. and Qiu, J., Nonlinear dynamics of shape memory alloys actuated bistable beams. Smart materials and structures. 28(5). PDF Amoozgar, M.R., Shaw, A.D., Zhang J. and Friswell, M.I., Composite Blade Twist Modification by Using a Moving Mass and Stiffness Tailoring. AIAA Journal, 57(10), 4218-4225. PDF Zhang J., Shaw, A.D., Amoozgar, M.R., Friswell, M.I. and Woods B.K.S., Bidirectional Torsional Negative Stiffness Mechanism for Energy Balancing Systems. Mechanism and Machine Theory, 131(2019), pp. 261-277. PDF Zhang J., Zhang, C., Hao, L., Nie, R. and Qiu, J., Exploiting the instability of Smart Structure for Reconfiguring. Applied Physics Letters, 111.6 (2017): 064102. PDF Zhang J. and McInnes, C. R., (2017) Using instability to reconfigure smart structures in a spring-mass model. Mechanical Systems and Signal Processing, 91:81-92. PDF Zhang J. McInnes, C. R., and Xu M., (2017) Reconfiguration of a Smart Surface using Heteroclinic Connections. Proceedings of the Royal Society of London Series A: Mathematical, Physical and Engineering Sciences, 473: 20160614. PDF Zhang J. and McInnes, C. R., (2016) Reconfiguration of a four-bar mechanism using phase space connections. Mechanical Systems and Signal Processing, 81 43–59. PDF Zhang J. and McInnes, C. R. (2015). Reconfiguring Smart Structures Using Approximate Heteroclinic Connections. Smart Materials and Structures, 24(10). PDF Zhang J., Wang, J. and Meng, L., (2015) Active Vibration Control for Large-space Deployable Antennas. Aircraft Design. 2015, 35(6): 15-17. PDF Wang, J., Yang, Y., Zhang J. and Su, H., (2012) Investigation of Piezoelectric Actuator Optimal Configuration for Structural Vibration Control. Acta Aeronoutica et Astronautica Sinica, 2012, 33(3): 494-500. PDF Peer Review Conference Papers Huang K., Zhang, J., Wang, Q. Bifurcations of A Pair of Series-Connected Bistable Cells. The 26th International Congress of Theoretical and Applied Mechanics (ICTAM 2024), Daegu, Korea, August 25-30, 2024. Huang K., Zhang, J., Zhao, Z., Wang, Q. Design and Aeroelastic Analysis of a Span Morphing Wing for Mars Exploration. The 26th International Congress of Theoretical and Applied Mechanics (ICTAM 2024), Daegu, Korea, August 25-30, 2024. Fan X., Liu Y., Zhang, J. Nonlinear Dynamics of Bistable Composite Cantilever Shells under External Excitation. The 26th International Congress of Theoretical and Applied Mechanics (ICTAM 2024), Daegu, Korea, August 25-30, 2024. Zhang C., Huang k., Zhang, J., Wang, Q. Nonlinear Two-Dimensional Wing Section Control Based On The Inverse Method. The 26th International Congress of Theoretical and Applied Mechanics (ICTAM 2024), Daegu, Korea, August 25-30, 2024. 刘雨婷, 黄可, 张家应, 王青云. 双稳态压电复合材料层合板的共振驱动及其优化设计. 第十九届现代数学和力学学术会议, 广西, 中国, 04月12-14日, 2024. 张晨曦, 张家应, 王青云. 非线性二元机翼颤振的逆动力学控制及其不确定性研究. 第十九届现代数学和力学学术会议, 广西, 中国, 04月12-14日, 2024. 范兴平, 刘雨婷, 张家应, 王青云. 外部激励下悬臂双稳态板的非线性动力学. 第十九届现代数学和力学学术会议, 广西, 中国, 04月12-14日, 2024. 黄可, 张家应, 王青云. 基于板梁耦合模型的鱼骨柔性翼颤振特性分析. 第十九届现代数学和力学学术会议, 广西, 中国, 04月12-14日, 2024. 武冠振, 张家应, 赵振, 王青云. 火星探测飞行器变展长设计及其主动控制. 首届空天前沿大会（AFC 2024）, 西安, 中国, 04月12-15日, 2024. 朱学仁, 陈玮, 张家应. 拉扭耦合超结构设计与验证. 首届空天前沿大会（AFC 2024）, 西安, 中国, 04月12-15日, 2024. 黄可, 张家应, 王青云. 基于板梁耦合模型的鱼骨柔性翼颤振特性分析. 北京力学会第三十届学术年会, 北京, 中国, 03月24, 2024. 张晨曦, 张家应, 王青云. 非线性二元机翼颤振的逆动力学控制及其不确定性研究. 北京力学会第三十届学术年会, 北京, 中国, 03月24, 2024. 武冠振, 张家应, 赵振, 王青云.火星探测飞行器变展长设计及其动力学特性分析. 北京力学会第三十届学术年会, 北京, 中国, 03月24, 2024. Liu Y., Zhang, J., Wang, Q. The Nonlinear Dynamic Characteristic and Resonant Actuation of Bistable Composite Laminates with MFC. The 2nd International Conference on Mechanical System Dynamics, (ICMSD2023), Beijing, China, 1-4 Sep, 2023. Huang K., Zhang, J., Wang, Q. Parametric Flutter Analysis of Camber Morphing Wing Using Beam-plate Coupled Model. The 2nd International Conference on Mechanical System Dynamics, (ICMSD2023), Beijing, China, 1-4 Sep, 2023. 刘雨婷, 黄可, 张家应, 王青云. 双稳态压电复合材料层合板的共振驱动及其优化设计. “第十九届全国非线性振动会议”暨“第十六届全国非线性动力学和运动稳定性学术会议”(NVND2023), 天津, 中国, 05月05-07日, 2023. 张晨曦, 张家应, 王青云. 基于逆方法的非线性二元机翼控制. “第十九届全国非线性振动会议”暨“第十六届全国非线性动力学和运动稳定性学术会议”(NVND2023), 天津, 中国, 05月05-07日, 2023. 武冠振, 张家应, 王青云. 折叠变展长机翼结构设计及其主动控制. “第十九届全国非线性振动会议”暨“第十六届全国非线性动力学和运动稳定性学术会议”(NVND2023), 天津, 中国, 05月05-07日, 2023.Video 黄可, 张家应, 王青云. 基于多稳态蒙皮的鱼骨柔性翼结构特性研究. “第十九届全国非线性振动会议”暨“第十六届全国非线性动力学和运动稳定性学术会议”(NVND2023), 天津, 中国, 05月05-07日, 2023.Video 刘雨婷, 张家应. 双稳态复合材料层合板的非线性动力学特征及其共振驱动. 第五届全国飞行器结构与强度学术会议, 西安, 中国, 11月11-13日, 2022. PDF 黄可, 张家应, 王晨. 鱼骨柔性翼气动弹性特性分析. 第五届全国飞行器结构与强度学术会议, 西安, 中国, 11月11-13日, 2022. PDF Liu Y., Zhang, J., Wang, Q. Wang, Q. Nonlinear Dynamic Characteristics and Resonant Actuation of Bi-stable Composite Laminates. WCCM-APCOM2022, Yokohama &amp; Virtual, 31 Jul-5 Aug, 2022.PDF Shaw, A., Zhang, J., Wang, C., Woods, B., &amp; Friswell, M. I. System Level Optimisation of Passive Energy Balancing. In AIAA Scitech 2020 Forum, San Diego, USA, 03-07 Jan, 2022. PDF Wang, C., Zhang, J., Amoozgar, M., Shaw, A., Friswell, M. I., &amp; Woods, B. Passive Energy Balancing for Morphing Rotorcraft Actuation: Integration and optimisation. In AIAA Scitech 2020 Forum, Orlando , USA, 06-10 Jan, 2020. PDF Amoozgar, M.R., Shaw, A.D., Zhang, J., Wang, C and Friswell, M.I. Performance analysis of inertial twist morphing concept in hovering flight. 45th European Rotorcraft Forum, Warsaw, Poland, 17-20 Sep, 2019. PDF Zhang, J., Shaw, A.D., Wang, C., Amoozgar, M.R. and Friswell, M.I. Tailored Nonlinear Negative Stiffness Mechanisms for Linear Motion. 9th ECCOMAS Thematic Conference on Smart Structures and Materials, Paris, France, 08-12 Jul, 2019. PDF Wang, C., Zhang, J., Shaw, A.D., Amoozgar, M.R. and Friswell, M.I. Integration of The Spiral Pulley Negative Stiffness Mechanism into The Fishbac Morphing Wing. 9th ECCOMAS Thematic Conference on Smart Structures and Materials, Paris, France, 08-12 Jul, 2019. PDF Zhang, J., Shaw, A.D., Amoozgar, M.R., Friswell, M.I. and Woods B.K.S. Torsional Negative Stiffness Mechanism for bidirectional Morphing Aircraft Actuation. 6th Aircraft Structural Design Conference, Bristol, United Kingdom, 09-11 Sep, 2018. PDF Amoozgar, M.R., Shaw, A.D., Zhang, J. and Friswell, M.I. Cross-sectional design of a composite rotor blade for twist morphing. 6th Aircraft Structural Design Conference, Bristol, United Kingdom, 09-11 Sep, 2018. PDF Amoozgar, M.R., Shaw, A.D., Zhang, J. and Friswell, M.I. Twist morphing of a hingless rotor blade using a moving mass. 44th European Rotorcraft Forum, Delft, The Netherlands, 18-21 Sep, 2018. PDF Zhang, J., Shaw, A.D., Amoozgar, M.R., Friswell, M.I. and Woods B.K.S. Spiral Pulley Negative Stiffness Mechanism for Morphing Aircraft Actuation. The ASME 2018 International Design Engineering Technical Conferences &amp; Computers and Information in Engineering Conference, Quebec City, Canada, 26-29 Aug, 2018. PDF Zhang, J. and Li, X. Optimal configuration of sensors in active vibration control. The Fourth International Academic Conference for Graduates, Nanjing, China, 26-28 Oct, 2016. PDF Zhang, J. and McInnes, C.R. Reconfiguring Smart Structures using Approximate Heteroclinic Connections in a Spring-Mass Model. The ASME 2015 Conference on Smart Materials, Adaptive Structures and Intelligent Systems, Colorado Springs, USA, 21-23 Sep, 2015. PDF"},{"title":"archives","date":"2020-07-18T05:10:34.000Z","updated":"2025-02-03T05:07:36.226Z","comments":true,"path":"archives/index.html","permalink":"https://astar-lab.github.io/archives/index.html","excerpt":"","text":""},{"title":"contact","date":"2020-08-30T14:45:09.000Z","updated":"2025-02-03T05:07:36.227Z","comments":true,"path":"contact/index.html","permalink":"https://astar-lab.github.io/contact/index.html","excerpt":"","text":""},{"title":"Group","date":"2025-02-03T05:07:36.228Z","updated":"2025-02-03T05:07:36.228Z","comments":true,"path":"group/index.html","permalink":"https://astar-lab.github.io/group/index.html","excerpt":"","text":"等待建设中….."},{"title":"","date":"2016-12-31T10:09:56.000Z","updated":"2016-12-31T10:09:56.000Z","comments":false,"path":"history/index.html","permalink":"https://astar-lab.github.io/history/index.html","excerpt":"","text":""},{"title":"友链","date":"2022-05-28T03:09:14.000Z","updated":"2025-02-03T05:07:36.228Z","comments":true,"path":"link/index.html","permalink":"https://astar-lab.github.io/link/index.html","excerpt":"","text":""},{"title":"","date":"2017-02-24T09:37:05.000Z","updated":"2017-02-24T09:37:05.000Z","comments":true,"path":"tags/index.html","permalink":"https://astar-lab.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"我的简历","slug":"hello-world","date":"2023-01-09T10:08:33.000Z","updated":"2025-02-03T05:07:36.226Z","comments":true,"path":"hello-world.html","link":"","permalink":"https://astar-lab.github.io/hello-world.html","excerpt":"","text":"Our LabWelcome to the website of Astar(Advanced Aerostructure Dynamics Research) Lab led by Dr. Zhang. Our Lab is part of the department of Dynamics and Control at Beihang University. Our group is mainly engaged in the following fields:• Morphing Aircraft Systems (morphing structures, Guidance and Control, etc.);• Nonlinear Dynamics (applied in modeling dynamic system, etc.);• Smart Structures &amp; Control Systems. News 2024-10-01: Three papers are accepted by Aerospace Science and Technology. 2024-10-01: One paper is accepted by Structures. 2024-02-05: Happy New Year. 2024-06-05: Four papers are accepted in ICTAM 2024, Daegu, Korea. 2024-02-05: Happy New Year. 2023-09-01: Two papers are presented in ICMSD2023. 2023-08-15: A review paper is accepted by Electronics Optics &amp; Control. 2023-05-08: Four papers are presented in (NVND2023). 2021 January, Join in Beihang University. Selected Publications[1] Wang, C., Zhao, Y., Huang, K., Zhang, J., Shaw, A. D., Gu, H., Amoozgar, M.,Friswell, M.I. and Woods B.K.S. Integration of the passive energy balancing based actuation system into a camber morphing design. Aerospace Science and Technology,128(2024), 107786.PDF[2] Huang, K., Zhang, J., and Wang, Q., 基于非均匀梁模型的二维柔性机翼固有振动分析 (NATURAL VIBRATION ANALYSIS OF TWO-DIMENSIONAL FLEXIBLE WING BASED ON NON-UNIFORM BEAM MODEL), 力学学报(Chinese Journal of Theoretical and Applied Mechanics).PDF[3] Zhang J., Shaw, A.D., Wang, C., Gu, H., Amoozgar, M.R. and Friswell, M.I., Woods B.K.S. Aeroelastic Model and Analysis of an Active Camber Morphing Wing. Aerospace Science and Technology, 111 (2021), 106534. PDF[4] Zhang J., Shaw, A.D., Amoozgar, M.R., Friswell, M.I. and Woods B.K.S., Bidirectional Torsional Negative Stiffness Mechanism for Energy Balancing Systems. Mechanism and Machine Theory, 131(2019), pp. 261-277. PDF[5] Zhang J., Zhang, C., Hao, L., Nie, R. and Qiu, J., Exploiting the instability of Smart Structure for Reconfiguring. Applied Physics Letters, 111.6 (2017): 064102. PDF","categories":[],"tags":[]},{"title":"Markdown高级语法","slug":"markdown-advance-syntax","date":"2022-05-08T09:04:21.000Z","updated":"2022-05-08T09:04:21.000Z","comments":true,"path":"markdown-advance-syntax.html","link":"","permalink":"https://astar-lab.github.io/markdown-advance-syntax.html","excerpt":"只有少数编辑器支持，或者需要安装相应的扩展渲染，使用前请先预览确认。","text":"只有少数编辑器支持，或者需要安装相应的扩展渲染，使用前请先预览确认。 定义列表1234Term 1Term 2: Definition A: Definition B 会被编译成 123456&lt;dl&gt;&lt;dd&gt;Term 1&lt;/dd&gt;&lt;dd&gt;Term 2&lt;/dd&gt;&lt;dt&gt;Definition A&lt;dt&gt;&lt;dt&gt;Definition A&lt;dt&gt;&lt;/dl&gt; 目录通过[TOC]标记来插入目录。 在编辑器不支持[TOC]标记的情况下可以使用添加id的方法构建目录。 123456## Directory* [1.Content one](#chapter1)* [2.Content two](#chapter2)## &lt;span id=&quot;chapter1&quot;&gt;1.Content one&lt;/span&gt;## &lt;span id=&quot;chapter2&quot;&gt;2.Content two&lt;/span&gt; TeX公式内联的TeX公式使用一个美元符号标记。 1$\\Gamma(n) = (n-1)!\\quad\\forall n\\in\\mathbb N$ 会被编译成内联（行内）公式：$\\Gamma(n) &#x3D; (n-1)!\\quad\\forall n\\in\\mathbb N$ TeX公式块用独占一行的两个美元符号来标记。 1$$\\left \\lbrace \\sum_&#123;i=0&#125;^n i^3 = \\frac&#123;(n^2+n)(n+6)&#125;&#123;9&#125; \\right \\rbrace$$ 会被编译成 $$\\left \\lbrace \\sum_{i&#x3D;0}^n i^3 &#x3D; \\frac{(n^2+n)(n+6)}{9} \\right \\rbrace$$ 如果你的编辑器不支持这个功能，可以手动解决。首先引入mathjax脚本： 1&lt;script type=&quot;text/javascript&quot; src=&quot;https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML&quot;&gt;&lt;/script&gt; 之后，在需要插入公式的地方使用 &lt;script&gt; 标签包裹公式： 12345&lt;script type=&quot;math/tex&quot;&gt;\\Gamma(n) = (n-1)!\\quad\\forall n\\in\\mathbb N&lt;/script&gt;&lt;script type=&quot;math/tex; mode=display&quot;&gt;\\Gamma(z) = \\int_0^\\infty t^&#123;z-1&#125;e^&#123;-t&#125;dt\\,.&lt;/script&gt; 以上公式展示效果，在实际显示过程中，根据网络加载速度不同会有不同的解析展示速度，TeX的语法参考请见这里。 UML图语法为在代码块开始行后面加入语法声明，如 ```mermaid ，然后可以像这样来画uml时序图： sequenceDiagram Alice->>Bob: Hello Bob,how are you? Note right of Bob: Bob thinks Bob-->>Alice: I am fine thanks! and U? Note left of Alice: SB 其MarkDown代码如下： 1234567\\`\\`\\`mermaidsequenceDiagram Alice-&gt;&gt;Bob: Hello Bob,how are you? Note right of Bob: Bob thinks Bob--&gt;&gt;Alice: I am fine thanks! and U? Note left of Alice: SB\\`\\`\\` #代码块标识会被解析，实际上写代码块时不用添加转义符“\\” 时序图的语法请见 这里 或 这里。 uml流程图： graph LR; A-->B & C-->D; 其实现代码如下： 1234\\`\\`\\`mermaidgraph LR; A--&gt;B &amp; C--&gt;D;\\`\\`\\` 流程图的语法请见 这里， 更复杂点的flowchart可以看 这里 。 参考文档 MarkDown文档中如何画出流程图 https://github.com/wizardforcel/markdown-simple-world http://stevenshi.me/2017/06/26/hexo-insert-formula/ https://blog.csdn.net/u013282174/article/details/80666123 https://www.liuyude.com/How_to_make_your_HEXO_blog_support_handwriting_flowchart.html https://mermaidjs.github.io/","categories":[{"name":"学编程","slug":"学编程","permalink":"https://astar-lab.github.io/categories/%E5%AD%A6%E7%BC%96%E7%A8%8B/"}],"tags":[{"name":"混技能","slug":"混技能","permalink":"https://astar-lab.github.io/tags/%E6%B7%B7%E6%8A%80%E8%83%BD/"}]},{"title":"网页模板 pug 基本语法","slug":"hexo-pug-notes","date":"2021-12-10T07:22:57.000Z","updated":"2021-12-10T07:22:51.000Z","comments":true,"path":"hexo-pug-notes.html","link":"","permalink":"https://astar-lab.github.io/hexo-pug-notes.html","excerpt":"","text":"前言pug 原名 jade ，因版权问题更名为 pug ，即哈巴狗。与 hexo 默认模块 ejs 一样，pug 也是一个模板引擎，可用于快速的网站开发，当然也可以用于静态博客网站的设计。本站点现时所用主题 manupassant 也使用了 pug 。 本文针对 Hexo 中使用 pug 的情况为例，说明其基本语法。 安装12345# common installnpm install pug# install for hexo blognpm install hexo-renderer-pug --save 语法pug 不同于 html ，前者不需要标签的开和闭，如 html 的 &lt;p&gt;Demo&lt;/p&gt; ，在 pug 使用 p Demo 即可。 缩进pug 对空格敏感，有点类似 python 对制表符tab敏感。pug 使用空格作为缩进符，当然用 soft tab 也可行。同一级标签需保证左对齐。 123div p Hello, world! p Hello, pug. 渲染结果如下： 1234&lt;div&gt; &lt;p&gt;Hellow, world!&lt;/p&gt; &lt;p&gt;Hello, pug.&lt;/p&gt;&lt;/div&gt; 注释pug 使用 //- 或 // 对代码进行注释，前者注释内容不出现在渲染后的 html 文件中，后者反之。 12//- html中不包含此行// html中会包含此行 属性pug 将标签属性存放于括号 () 内，多个属性之间以 逗号 或 空格 分隔。此外，对于标签的 id 和 class ，pug 使用 # 紧跟标签 id ,使用 . 紧跟标签 class ，可以同时设置多个 class 。 12h1#title Test titleimg#name.class1.class2(src=&quot;/test.png&quot; alt=&quot;test&quot;) 渲染结果如下： 12&lt;h1 id=&quot;title&quot;&gt;Test title&lt;/h1&gt;&lt;img id=&quot;name&quot; class=&quot;class1 class2&quot; src=&quot;/test.png&quot; alt=&quot;test&quot;&gt; 包含为了方便代码复用，pug 提供了 include 包含功能，以下代码会将 _partial 目录下的 head.pug 文件内容包含到当前调用的位置。有点 C&#x2F;C++ 中内联函数的意思。 123doctype htmlhtml(lang=&#x27;en&#x27;) include _partial/head.pug 继承下面是一个简单的 base 模板，通过 block 定义了页面头部 head 和内容 body 。块 block 有点类似 C&#x2F;C++ 的抽象函数，需要在继承者中完成定义，填充具体内容。 123456//- base.pughtml head block title body block content 以下文件使用 extends 继承以上模板，通过 block 覆盖或替换原有块 block 。当然，继承者也可以在原有基础上继续扩展。 123456789//- index.pugextends base.pugblock title title &quot;Test title&quot;block content h1 Hello world! block article 定义变量pug中通过 - var name = value 的形式定义变量 123456- var intData = 100- var boolData = false- var stringData = &#x27;Test&#x27;p.int= intDatap.bool= boolDatap.stringData= stringData 需注意的是，在引用变量时，需要在引用位置加上&#x3D;号，否则会默认将变量名当成普通字符串使用。 如果想要将变量与其它字符串常量或是变量连接在一起，就不能用等号了，而是应该用 #&#123;&#125; ，该符号会对大括号内的变量进行求值和转义，最终得到渲染输出的内容。 1234- var girl = &#x27;Lily&#x27;- var boy = &#x27;Jack&#x27;p #&#123;girl&#125; is so beautiful!p And #&#123;boy&#125; is handsome. 条件结构pug 的条件语句与其它语言类似，均是如下这般： 12345678- var A = &#123;value: &#x27;Test&#x27;&#125;- var B = trueif A.value p= A.valueelse if B p= Belse p nothing 迭代pug 中使用 each 和 while 实现循环迭代，each 可以返回当前所在项的索引值，默认从 0 开始计数。 12345678910//- eachol each item in [&#x27;Sun&#x27;, &#x27;Mon&#x27;, &#x27;Tus&#x27;, &#x27;Wen&#x27;, &#x27;Thu&#x27;, &#x27;Fri&#x27;, &#x27;Sat&#x27;] li= item//- get index of each- var week = [&#x27;Sun&#x27;, &#x27;Mon&#x27;, &#x27;Tus&#x27;, &#x27;Wen&#x27;, &#x27;Thu&#x27;, &#x27;Fri&#x27;, &#x27;Sat&#x27;]ol each item, index in week li= index + &#x27;:&#x27; + item 渲染成 html 后： 123456789101112131415161718&lt;ol&gt; &lt;li&gt;Sun&lt;/li&gt; &lt;li&gt;Mon&lt;/li&gt; &lt;li&gt;Tus&lt;/li&gt; &lt;li&gt;Wen&lt;/li&gt; &lt;li&gt;Thu&lt;/li&gt; &lt;li&gt;Fri&lt;/li&gt; &lt;li&gt;Sat&lt;/li&gt;&lt;/ol&gt;&lt;ol&gt; &lt;li&gt;0:Sun&lt;/li&gt; &lt;li&gt;1:Mon&lt;/li&gt; &lt;li&gt;2:Tus&lt;/li&gt; &lt;li&gt;3:Wen&lt;/li&gt; &lt;li&gt;4:Thu&lt;/li&gt; &lt;li&gt;5:Fri&lt;/li&gt; &lt;li&gt;6:Sat&lt;/li&gt;&lt;/ol&gt; while 调用方式如下： 12345//- while- var day = 1ul while day &lt; 7 li= day++ Minixmixin 名曰混入，类似其它编程语言中的函数，也是为了代码复用，可带参数或不带参数，定义方式如下： 1234mixin menu-item(href, name) li span.dot ● a(href=href)= name 其中，menu-item 为调用时所用名称，可认为是函数名，href 及 name 是参数。同上定义变量所说，a(href=href)= name 中第二个 = 是为了将后面的 name 当作参数来处理，而不是当作字符串 &quot;name&quot; 来处理。 调用 mixin 定义的代码块，需通过 + 号紧跟 mixin 名称及参数: 12+menu-item(&#x27;/Archives&#x27;,&#x27;Archives&#x27;)+menu-item(&#x27;/About&#x27;,&#x27;About&#x27;) mixin 之所以称为混入，是因为其语法不局限于函数调用，在 mixin 可以使用块 block 12345678910mixin print(post) if block block else p= post+print(&quot;no block&quot;)+print(&quot;&quot;) div.box p this is the content of block 对应 html 代码： 12&lt;p&gt;no block&lt;/p&gt;&lt;div class=&quot;box&quot;&gt;&lt;p&gt;this is the content of block&lt;/p&gt;&lt;/div&gt; JavaScript 注意以下 pug 语句中第一行的 . 号。 1234567script(type=&#x27;text/javascript&#x27;). var data = &quot;Test&quot; var enable = true if enable console.log(data) else console.log(&#x27;nothing&#x27;) 对应的 JS 代码如下： 12345678&lt;script type=&#x27;text/javascript&#x27;&gt; var data = &quot;Test&quot; var enable = true if enable console.log(data) else console.log(&#x27;nothing&#x27;)&lt;/script&gt; 对于简单脚本，使用 pug 尚可，复杂的还是单独写到 .js 文件中，然后通过 pug 引用方便一些，引用方式如下： 1234script(type=&#x27;text/javascript&#x27;, src=&#x27;/path/to/js&#x27;)//- with hexo function url_forscript(type=&#x27;text/javascript&#x27;, src=url_for(theme.js) + &#x27;/ready.js&#x27;) hexo 相关在 hexo 主题中使用 pug 时，可以通过使用 hexo 提供的全局变量 config ， theme 来分别调用博客根目录下 _config.yml 文件中的参数以及主题根目录下 _config.yml 文件中的参数。 12345//- blog configp= config.description//- theme configp= theme.title 当然，pug 中可以直接使用 hexo 提供的其它全局变量及辅助函数，使用方法详见 hexo 的文档。 示例12345678910111213//- head.pughead meta(http-equiv=&#x27;content-type&#x27;, content=&#x27;text/html; charset=utf-8&#x27;) meta(content=&#x27;width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0&#x27;, name=&#x27;viewport&#x27;) meta(content=&#x27;yes&#x27;, name=&#x27;apple-mobile-web-app-capable&#x27;) meta(content=&#x27;black-translucent&#x27;, name=&#x27;apple-mobile-web-app-status-bar-style&#x27;) meta(content=&#x27;telephone=no&#x27;, name=&#x27;format-detection&#x27;) meta(name=&#x27;description&#x27;, content=config.description) block title link(rel=&#x27;stylesheet&#x27;, type=&#x27;text/css&#x27;, href=url_for(theme.css) + &#x27;/style.css&#x27; + &#x27;?v=&#x27; + theme.version) link(rel=&#x27;Shortcut Icon&#x27;, type=&#x27;image/x-icon&#x27;, href=url_for(&#x27;favicon.png&#x27;)) script(type=&#x27;text/javascript&#x27;, src=&#x27;//cdn.bootcss.com/jquery/3.3.1/jquery.min.js&#x27;) block more 12345678910111213141516//- base.pugdoctype htmlhtml(lang=&#x27;en&#x27;) include _partial/head.pug block more link(rel=&#x27;stylesheet&#x27;, type=&#x27;text/css&#x27;, href=url_for(theme.plugins) + &#x27;/prettify/doxy.css&#x27;) script(type=&#x27;text/javascript&#x27;, src=url_for(theme.js) + &#x27;/ready.js&#x27; + &#x27;?v=&#x27; + theme.version, async) //- body body: #container.box .h-wrapper include _partial/nav-menu.pug // article content block content include _partial/footer.pug 其中: theme.* 为主题配置文件 _config.yml 中的参数 url_for 为 hexo 提供的用于查找资源路径的函数 总结pug 提供了 包含 ，继承 ，Mixin 等多种方式用于代码复用，语法简洁易懂，除了初学时需花费一些时间学习各种标点符号的含义外，其它倒也没有太大困难。 当然啦，pug 还有许多其它特性，但就我目前使用情况而言，以上这些便已足够。 参考 pugjs.org hexo.io&#x2F;zh-cn&#x2F;docs&#x2F; 原文出处 作者：litreily 链接：https://juejin.cn/post/6844903668383236104 来源：掘金 著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。","categories":[{"name":"学编程","slug":"学编程","permalink":"https://astar-lab.github.io/categories/%E5%AD%A6%E7%BC%96%E7%A8%8B/"}],"tags":[{"name":"博客建站","slug":"博客建站","permalink":"https://astar-lab.github.io/tags/%E5%8D%9A%E5%AE%A2%E5%BB%BA%E7%AB%99/"}]}],"categories":[{"name":"学编程","slug":"学编程","permalink":"https://astar-lab.github.io/categories/%E5%AD%A6%E7%BC%96%E7%A8%8B/"}],"tags":[{"name":"混技能","slug":"混技能","permalink":"https://astar-lab.github.io/tags/%E6%B7%B7%E6%8A%80%E8%83%BD/"},{"name":"博客建站","slug":"博客建站","permalink":"https://astar-lab.github.io/tags/%E5%8D%9A%E5%AE%A2%E5%BB%BA%E7%AB%99/"}]}